"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""

# Решение пункта а


from sys import argv

name, origin_start, origin_end = argv


def my_iter(start, end):
    """
            Итератор принемающий старт и конец.
        """
    while start <= end:
        yield start
        start += 1


print(*list(my_iter(int(origin_start), int(origin_end))))
